armku/StdOS/STDOS/Platform/STM32F1/PwmSolo.cpp
            /* PWM1 Mode configuration: Channel1 */
            TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; //配置为PWM模式1
            TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
            TIM_OCInitStructure.TIM_Pulse = this->duty; //CCR1_Val;	   //设置跳变值，当计数器计数到这个值时，电平发生跳变
            TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //当定时器计数值小于CCR1_Val时为高电平
            TIM_OC1Init(TIM3, &TIM_OCInitStructure); //使能通道1
            TIM_OC1PreloadConfig(TIM3, TIM_OCPreload_Enable);
            /* TIM3 enable counter */
            TIM_Cmd(TIM3, ENABLE); //使能定时器3	
            TIM_OC1Init(TIM3, &TIM_OCInitStructure); //使能通道1
            break;
        case PC7:
            //TIM3-CH2 remap
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);
            GPIO_PinRemapConfig(GPIO_FullRemap_TIM3, ENABLE);

            RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

            /* PWM信号电平跳变值 */
            //u16 CCR1_Val = 500;        
            /* Time base configuration */
            TIM_TimeBaseStructure.TIM_Period = this->freq; //999;       //当定时器从0计数到999，即为1000次，为一个定时周期
            TIM_TimeBaseStructure.TIM_Prescaler = 0; //设置预分频：不预分频，即为72MHz
            TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; //设置时钟分频系数：不分频(这里用不到)
            TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; //向上计数模式
            TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);

            /* PWM1 Mode configuration: Channel2 */
            TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; //配置为PWM模式1
            TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
            TIM_OCInitStructure.TIM_Pulse = this->duty; //设置通道2的电平跳变值，输出另外一个占空比的PWM
            TIM_OC2Init(TIM3, &TIM_OCInitStructure); //使能通道2
            TIM_OC2PreloadConfig(TIM3, TIM_OCPreload_Enable);
            /* TIM3 enable counter */
            TIM_Cmd(TIM3, ENABLE); //使能定时器3	
            TIM_OC2Init(TIM3, &TIM_OCInitStructure); //使能通道2
            break;
        case PC8:
            //TIM3-CH3 remap
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);
            GPIO_PinRemapConfig(GPIO_FullRemap_TIM3, ENABLE);

            RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

            /* PWM信号电平跳变值 */
            //u16 CCR1_Val = 500;        
            /* Time base configuration */
            TIM_TimeBaseStructure.TIM_Period = this->freq; //999;       //当定时器从0计数到999，即为1000次，为一个定时周期
            TIM_TimeBaseStructure.TIM_Prescaler = 0; //设置预分频：不预分频，即为72MHz
            TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; //设置时钟分频系数：不分频(这里用不到)
            TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; //向上计数模式
            TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);

            /* PWM1 Mode configuration: Channel3 */
            TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; //配置为PWM模式1
            TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
            TIM_OCInitStructure.TIM_Pulse = this->duty; //设置通道3的电平跳变值，输出另外一个占空比的PWM
            TIM_OC3Init(TIM3, &TIM_OCInitStructure); //使能通道3
            TIM_OC3PreloadConfig(TIM3, TIM_OCPreload_Enable);
            /* TIM3 enable counter */
            TIM_Cmd(TIM3, ENABLE); //使能定时器3	
            TIM_OC3Init(TIM3, &TIM_OCInitStructure); //使能通道3
            break;
        case PC9:
            //TIM3-CH4 remap
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);
            GPIO_PinRemapConfig(GPIO_FullRemap_TIM3, ENABLE);

            RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

            /* PWM信号电平跳变值 */
            //u16 CCR1_Val = 500;        
            /* Time base configuration */
            TIM_TimeBaseStructure.TIM_Period = this->freq; //999;       //当定时器从0计数到999，即为1000次，为一个定时周期
            TIM_TimeBaseStructure.TIM_Prescaler = 0; //设置预分频：不预分频，即为72MHz
            TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; //设置时钟分频系数：不分频(这里用不到)
            TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; //向上计数模式
            TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);

            /* PWM1 Mode configuration: Channel4 */
            TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; //配置为PWM模式1
            TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
            TIM_OCInitStructure.TIM_Pulse = this->duty; //设置通道4的电平跳变值，输出另外一个占空比的PWM
            TIM_OC4Init(TIM3, &TIM_OCInitStructure); //使能通道4
            TIM_OC4PreloadConfig(TIM3, TIM_OCPreload_Enable);
            TIM_ARRPreloadConfig(TIM3, ENABLE); // 使能TIM3重载寄存器ARR
            /* TIM3 enable counter */
            TIM_Cmd(TIM3, ENABLE); //使能定时器3	
            TIM_OC4Init(TIM3, &TIM_OCInitStructure); //使能通道4
            break;
        case PD12:
            //TIM4-CH1 remap
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO, ENABLE);
            GPIO_PinRemapConfig(GPIO_Remap_TIM4, ENABLE);

            RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

            /* PWM信号电平跳变值 */
            //u16 CCR1_Val = 500;        
            /* Time base configuration */
            TIM_TimeBaseStructure.TIM_Period = this->freq; //999;       //当定时器从0计数到999，即为1000次，为一个定时周期
            TIM_TimeBaseStructure.TIM_Prescaler = 0; //设置预分频：不预分频，即为72MHz
            TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; //设置时钟分频系数：不分频(这里用不到)
            TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; //向上计数模式
            TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);

            /* PWM1 Mode configuration: Channel1 */
            TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; //配置为PWM模式1
            TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
            TIM_OCInitStructure.TIM_Pulse = this->duty; //CCR1_Val;	   //设置跳变值，当计数器计数到这个值时，电平发生跳变
            TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //当定时器计数值小于CCR1_Val时为高电平
            TIM_OC1Init(TIM4, &TIM_OCInitStructure); //使能通道1
            TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);
            /* TIM4 enable counter */
            TIM_Cmd(TIM4, ENABLE); //使能定时器4	
            TIM_OC1Init(TIM4, &TIM_OCInitStructure); //使能通道1
            break;
        case PD13:
            //TIM4-CH2 remap
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO, ENABLE);
            GPIO_PinRemapConfig(GPIO_Remap_TIM4, ENABLE);

